<a href="https://colab.research.google.com/github/RJGiannini/nft-project-group8/blob/main/collection_sales_data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd
import requests
import json
from pprint import pprint

In [2]:
# Upload cc_default.csv to Colab
from google.colab import files

csv_file = files.upload()

Saving collections_list.xlsx to collections_list (13).xlsx

In [3]:
# Read the cc_default.csv file from the Resources folder into a Pandas DataFrame
collections_df = pd.read_excel("collections_list.xlsx")

# Review the DataFrame
collections_df

                             Name
0                       0N1 Force
1                888 inner circle
2                       Anonymice
3                        Ape Gang
4              Art Blocks Curated
..                            ...
95                   Winter Bears
96  Woodies Generative Characters
97                 World of Women
98                        ZED RUN
99                    ZombieToadz

[100 rows x 1 columns]

In [4]:
collection_list = [x for x in collections_df['Name']]

In [5]:
#collection_list

In [6]:
collection_list_two = []
for i in collection_list:
  collection_list_two.append(i.replace(" ", "-"))

In [7]:
#collection_list_two

In [8]:
collection_list_three = []
for i in collection_list_two:
  collection_list_three.append(i.lower())

In [9]:
#collection_list_three

In [10]:
df = pd.DataFrame()
for collection in collection_list_three:
  
  url = "https://api.opensea.io/api/v1/assets?order_by=sale_count&order_direction=desc&offset=0&limit=50&collection=" + collection

  JSONContent = requests.get(url).json()

  content = json.dumps(JSONContent, indent = 2, sort_keys=True)

  JSONContent.keys()

  #assets = JSONContent["assets"]

  df = df.append(JSONContent["assets"])

In [61]:
#df

In [32]:
collection_df = df['collection'].apply(pd.Series)
#collection_df

In [62]:
collection_name = collection_df["name"].apply(pd.Series)
collection_name.columns = ['Collection Name']
#collection_name

In [27]:
last_sale_df = df['last_sale'].apply(pd.Series)
#last_sale_df

In [56]:
total_price = last_sale_df['total_price'].apply(pd.Series)
total_price.columns = ['Last Sale Price']
total_price

        Last Sale Price
0   1740000000000000000
1   2750000000000000000
2   2250000000000000000
3   2200000000000000000
4   3450000000000000000
..                  ...
46  1000000000000000000
47   333000000000000000
48   450000000000000000
49   190000000000000000
0     70000000000000000

[2915 rows x 1 columns]

In [34]:
payment_token_df = last_sale_df['payment_token'].apply(pd.Series)
#payment_token_df

In [52]:
decimals = payment_token_df['decimals'].apply(pd.Series)
decimals.columns = ['Decimal Scale']
decimals

    Decimal Scale
0            18.0
1            18.0
2            18.0
3            18.0
4            18.0
..            ...
46           18.0
47           18.0
48           18.0
49           18.0
0            18.0

[2915 rows x 1 columns]

In [51]:
eth_price = payment_token_df['eth_price'].apply(pd.Series)
eth_price.columns = ['USD TO ETH']
eth_price

           USD TO ETH
0   1.000000000000000
1   1.000000000000000
2   1.000000000000000
3   1.000000000000000
4   1.000000000000000
..                ...
46  1.000000000000000
47  1.000000000000000
48  1.000000000000000
49  1.000000000000000
0   1.000000000000000

[2915 rows x 1 columns]

In [50]:
usd_price = payment_token_df['usd_price'].apply(pd.Series)
usd_price.columns = ['ETH TO USD']
usd_price

                 ETH TO USD
0   3467.269999999999982000
1   3467.269999999999982000
2   3467.269999999999982000
3   3473.630000000000109000
4   3467.269999999999982000
..                      ...
46  3467.269999999999982000
47  3467.269999999999982000
48  3467.269999999999982000
49  3467.269999999999982000
0   3473.630000000000109000

[2915 rows x 1 columns]

In [59]:
X = df[['name', 'id', 'token_id', 'num_sales']].copy()
X.columns = ['Asset Name', 'Asset ID', 'Token ID', 'Number of Sales']

In [60]:
pd.concat([X, collection_name, total_price, decimals, eth_price, usd_price], axis = 1)

       Asset Name  Asset ID  ...         USD TO ETH               ETH TO USD
0       0N1 #6911  38109417  ...  1.000000000000000  3467.269999999999982000
1       0N1 #3338  38105661  ...  1.000000000000000  3467.269999999999982000
2       0N1 #1601  37768360  ...  1.000000000000000  3467.269999999999982000
3       0N1 #2181  38104277  ...  1.000000000000000  3473.630000000000109000
4       0N1 #7012  38109401  ...  1.000000000000000  3467.269999999999982000
..            ...       ...  ...                ...                      ...
46   Miss Thought   3409840  ...  1.000000000000000  3467.269999999999982000
47  Sussex Muster   3404105  ...  1.000000000000000  3467.269999999999982000
48      Pyro Hero   3307434  ...  1.000000000000000  3467.269999999999982000
49        Tornado  14462054  ...  1.000000000000000  3467.269999999999982000
0              #4  60149140  ...  1.000000000000000  3473.630000000000109000

[2915 rows x 9 columns]